{"config": [{"config": {"name": "convolution2d_1", "activity_regularizer": null, "border_mode": "same", "batch_input_shape": [null, 64, 64, 3], "bias": true, "W_regularizer": null, "nb_filter": 32, "input_dtype": "float32", "nb_col": 5, "b_regularizer": null, "init": "glorot_uniform", "activation": "linear", "nb_row": 5, "subsample": [2, 2], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_1", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "convolution2d_2", "activity_regularizer": null, "border_mode": "valid", "bias": true, "nb_filter": 16, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_2", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_1", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "maxpooling2d_1", "border_mode": "valid", "strides": [2, 2], "dim_ordering": "tf", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "convolution2d_3", "activity_regularizer": null, "border_mode": "valid", "bias": true, "nb_filter": 8, "W_regularizer": null, "init": "glorot_uniform", "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "subsample": [1, 1], "dim_ordering": "tf", "b_constraint": null, "trainable": true, "W_constraint": null}, "class_name": "Convolution2D"}, {"config": {"name": "elu_3", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dropout_2", "p": 0.4, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_1", "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 1024, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "dropout_3", "p": 0.3, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "elu_4", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_2", "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 512, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}, {"config": {"name": "elu_5", "trainable": true, "alpha": 1.0}, "class_name": "ELU"}, {"config": {"name": "dense_3", "activity_regularizer": null, "W_constraint": null, "bias": true, "W_regularizer": null, "output_dim": 1, "init": "glorot_uniform", "b_regularizer": null, "activation": "linear", "input_dim": null, "b_constraint": null, "trainable": true}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.0.7"}