{"config": [{"config": {"subsample": [2, 2], "activation": "linear", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "input_dtype": "float32", "W_regularizer": null, "b_constraint": null, "batch_input_shape": [null, 64, 64, 3], "nb_col": 5, "init": "glorot_uniform", "trainable": true, "name": "convolution2d_1", "b_regularizer": null, "nb_filter": 32, "nb_row": 5, "W_constraint": null, "border_mode": "same"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_1"}, "class_name": "ELU"}, {"config": {"subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_2", "b_regularizer": null, "nb_filter": 16, "nb_row": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_2"}, "class_name": "ELU"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"pool_size": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_1", "strides": [2, 2], "trainable": true, "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"subsample": [1, 1], "activation": "linear", "dim_ordering": "tf", "activity_regularizer": null, "bias": true, "W_regularizer": null, "b_constraint": null, "W_constraint": null, "nb_col": 3, "init": "glorot_uniform", "name": "convolution2d_3", "b_regularizer": null, "nb_filter": 8, "nb_row": 3, "trainable": true, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_3"}, "class_name": "ELU"}, {"config": {"p": 0.4, "trainable": true, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "linear", "b_constraint": null, "bias": true, "output_dim": 1024, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"p": 0.3, "trainable": true, "name": "dropout_3"}, "class_name": "Dropout"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_4"}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "bias": true, "output_dim": 512, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_2", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"alpha": 1.0, "trainable": true, "name": "elu_5"}, "class_name": "ELU"}, {"config": {"activation": "linear", "b_constraint": null, "bias": true, "output_dim": 1, "input_dim": null, "W_regularizer": null, "init": "glorot_uniform", "name": "dense_3", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential", "keras_version": "1.0.7"}